{
  "guideline_id": "II.H",
  "semantic_title": "Coding Uncertain Diagnoses in Inpatient Settings",
  "section_path": "Section II > H. Uncertain Diagnosis",
  "page_number": 109,
  "content": {
    "full_text": "If the diagnosis documented at the time of discharge is qualified as \"probable,\" \"suspected,\" \"likely,\" \"questionable,\" \"possible,\" or \"still to be ruled out,\" \"compatible with,\" \"consistent with,\" or other similar terms indicating uncertainty, code the condition as if it existed or was established. The bases for these guidelines are the diagnostic workup, arrangements for further workup or observation, and initial therapeutic approach that correspond most closely with the established diagnosis. Note: This guideline is applicable only to inpatient admissions to short-term, acute, long-term care and psychiatric hospitals. (Evidence: pg no: 109, L35-L38)",
    "summary": "In inpatient settings, uncertain diagnoses should be coded as if they were confirmed diagnoses (Evidence: pg no: 109, L35-L38)",
    "key_concepts": [
      "Uncertain diagnoses coded as confirmed in inpatient settings (Evidence: pg no: 109, L35-L37)",
      "Multiple qualifying terms indicate uncertainty (Evidence: pg no: 109, L35-L36)",
      "Based on diagnostic workup and therapeutic approach (Evidence: pg no: 109, L37)",
      "Applies only to inpatient settings (Evidence: pg no: 109, L37-L38)"
    ],
    "detailed_rules": [
      {
        "rule_id": "II.H.1",
        "rule_text": "Code uncertain diagnoses as if they existed or were established (Evidence: pg no: 109, L37)",
        "explanation": "When diagnoses are qualified with terms indicating uncertainty, they should be coded as confirmed diagnoses in inpatient settings (Evidence: pg no: 109, L35-L37)",
        "importance": "critical",
        "applies_to": "all_codes",
        "common_applications": [
          "Probable pneumonia",
          "Suspected myocardial infarction",
          "Likely appendicitis"
        ]
      },
      {
        "rule_id": "II.H.2",
        "rule_text": "This guideline is applicable only to inpatient admissions to short-term, acute, long-term care and psychiatric hospitals (Evidence: pg no: 109, L37-L38)",
        "explanation": "The uncertain diagnosis rule applies exclusively to inpatient settings and does not apply to outpatient encounters (Evidence: pg no: 109, L37-L38)",
        "importance": "critical",
        "applies_to": "all_codes",
        "common_applications": [
          "Inpatient hospital stays",
          "Psychiatric hospital admissions"
        ]
      }
    ],
    "workflow_steps": [
      "Step 1: Identify if diagnosis has qualifying uncertain terms",
      "Step 2: Confirm this is an inpatient setting",
      "Step 3: Code the uncertain diagnosis as if it were confirmed",
      "Step 4: Base coding on diagnostic workup and therapeutic approach"
    ],
    "related_terminology": [
      "probable",
      "suspected",
      "likely",
      "questionable",
      "possible",
      "still to be ruled out",
      "compatible with",
      "consistent with",
      "uncertain diagnosis"
    ]
  },
  "code_references": {
    "code_ranges": [],
    "specific_codes": [],
    "code_patterns": [],
    "code_categories_mentioned": []
  },
  "cross_references": {
    "references_to": [],
    "referenced_by": []
  },
  "coding_scenarios": [
    {
      "scenario_id": "II.H.1",
      "scenario": "Inpatient with probable pneumonia based on clinical presentation and chest X-ray",
      "documentation_example": "Patient admitted with fever, cough, and chest X-ray showing probable pneumonia. Started on antibiotics.",
      "step_by_step": [
        "Step 1: Identify 'probable pneumonia' as uncertain diagnosis",
        "Step 2: Confirm this is inpatient setting",
        "Step 3: Code pneumonia as if confirmed",
        "Step 4: Base on diagnostic workup (X-ray) and treatment (antibiotics)"
      ],
      "correct_coding": {
        "primary_code": "J18.9",
        "secondary_codes": [],
        "sequencing": "Code pneumonia as confirmed diagnosis",
        "rationale": "Uncertain diagnoses are coded as confirmed in inpatient settings (Evidence: pg no: 109, L35-L37)"
      },
      "incorrect_coding": {
        "code": "R06.02",
        "codes": [
          "R06.02",
          "R50.9"
        ],
        "rationale": "Should not code symptoms when probable diagnosis is documented",
        "common_mistake": "Coding symptoms instead of the uncertain but probable diagnosis"
      }
    }
  ],
  "procedure_links": [],
  "examples": [],
  "special_notes": {
    "warnings": [
      "This rule applies ONLY to inpatient settings, not outpatient (Evidence: pg no: 109, L37-L38)"
    ],
    "best_practices": [
      "Base coding decisions on diagnostic workup and therapeutic approach (Evidence: pg no: 109, L37)"
    ],
    "common_mistakes": [
      "Applying uncertain diagnosis rule to outpatient settings (Evidence: pg no: 109, L37-L38)",
      "Coding symptoms instead of uncertain diagnoses in inpatient settings (Evidence: pg no: 109, L35-L37)"
    ],
    "tips": [
      "Look for qualifying terms that indicate uncertainty (Evidence: pg no: 109, L35-L36)"
    ],
    "implementation_notes": [
      "Applies to short-term, acute, long-term care and psychiatric hospitals"
    ],
    "clinical_context": [
      "Common when definitive testing is not available or conclusive"
    ]
  },
  "search_keywords": [
    "uncertain diagnosis",
    "probable",
    "suspected",
    "likely",
    "questionable",
    "possible",
    "inpatient only",
    "rule out"
  ],
  "metadata": {
    "category": "general_guideline",
    "subcategory": "uncertain_diagnosis",
    "complexity_level": "intermediate",
    "applies_to_settings": [
      "inpatient"
    ],
    "last_updated": "FY 2026",
    "tags": [
      "uncertain_diagnosis",
      "inpatient_only",
      "probable",
      "suspected"
    ]
  },
  "page_range_processed": "pages_108_to_111"
}