{
  "procedure_id": "shoulder_hemiarthroplasty",
  "category": "Shoulder (Evidence: pg no: 7, L169)",
  "section_title": "Hemiarthroplasty (Evidence: pg no: 9, L289)",
  "names": [
    "Hemiarthroplasty (Evidence: pg no: 9, L289)",
    "Shoulder hemiarthroplasty (Evidence: pg no: 7, L176)",
    "Partial replacement (Evidence: pg no: 7, L176)"
  ],
  "description": "Shoulder hemiarthroplasty (partial replacement) may be used to address isolated humeral head pathology (avascular necrosis), some fractures, or as an option for rotator cuff tear arthropathy. (Evidence: pg no: 7, L176-L177)",
  "scope": "This guideline addresses shoulder arthroplasty when performed as an elective, non-emergent procedure and not as part of the care of a congenital condition, acute or traumatic event such as fracture (excluding fracture of implant and periprosthetic fracture). (Evidence: pg no: 7, L181-L183)",
  "general_requirements": {
    "documentation": [
      "Proximal humerus fracture not amenable to internal fixation (Evidence: pg no: 9, L291)",
      "Malignancy involving the glenohumeral joint or surrounding soft tissue (Evidence: pg no: 10, L293)",
      "Advanced joint disease of the shoulder when criteria for total shoulder arthroplasty are met AND at least ONE of the following conditions is present (Evidence: pg no: 10, L294-L295)"
    ]
  },
  "exclusions": [
    "Total shoulder arthroplasty or hemiarthroplasty under conditions which would result in excessive stress on the implant including, but not limited to, Charcot joint and paralytic conditions of the shoulder (Evidence: pg no: 11, L332-L333)"
  ],
  "codes": [
    {
      "code": "23470",
      "system": "CPT",
      "description": "Arthroplasty, glenohumeral joint; hemiarthroplasty (Evidence: pg no: 11, L363)"
    }
  ],
  "notes": "Specific conditions include osteonecrosis of the humeral head without glenoid involvement, advanced joint disease due to rotator cuff tear arthropathy, glenoid bone stock inadequate to support a glenoid prosthesis, and glenohumeral osteoarthritis with irreparable rotator cuff tear. (Evidence: pg no: 10, L296-L299)"
}